#   /---------------------------------------------------------/
#  /    Ссылка >> https://kompege.ru/variant?kim=25070441    /
# /---------------------------------------------------------/

a = []
for n in range(1, 26):
    bin_n = bin(n)[2:]
    if n % 2 != 0:
        bin_n = "10" + bin_n + "1"
    else:
        bin_n = "10" + bin_n + "0111"
    a.append(int(bin_n, 2))
print(f"Ответ: {max(a)}")

# >>> a = []
# >>> for n in range(1, 26):
# >>>     bin_n = bin(n)[2:] <!-- Двоичная запись числа (исключая 0x в начале)--->
# >>>     if n % 2 != 0:
# >>>        bin_n = "10" + bin_n + "1"
# >>>     else:
# >>>         bin_n = "10" + bin_n + "0111"
# >>>     a.append(int(bin_n, 2))
# >>> print(f"Ответ: {max(a)}") <!-- Вывод максимального значения R --->
#     <!-- Альтернативное решение --->
# >>> print(max([int("10"+bin(n)[2:]+"1",2) if n%2!=0 else int("10"+bin(n)[2:]+"0111",2) for n in range(1,26)]))
